########################
#   Terminal emulator  #
########################
# GPU-based terminal emulator
cask "kitty"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Cross-shell prompt for astronauts
brew "starship"

###################
#   System admin  #
###################
# updated full bash -- default may not be the one you want
brew "bash"
# Fish shel;
brew "fish"
# ZSH
brew "zsh"
# Modern shell for the GitHub era
brew "nushell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# RipGrep but inside archive too
brew "ripgrep-all"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Disk analyzer
brew "dust"
# Disk analyzer bis
brew "dua-cli"
# Benchmarking
brew "hyperfine"
# Load/unload environment variables based on $PWD
brew "direnv"
# Keyboard programming
brew "kanata"
# Bitwarden cli
brew "bitwarden-cli"
# Unofficial bitwarden client
brew "rbw"
# Python package manager
brew "uv"
# Autocompletion
brew "carapace"
# System monitor
brew "btop"
# Xargs equivalent
brew "xe"
# Netcat, useful for Godot LSP
brew "nc"

######################
#   Developer tools  #
######################
# Distributed revision control system
brew "git"
# Nicer diff
brew "git-delta"
# GitHub command-line tool
brew "gh"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Ambitious Vim-fork focused on extensibility and agility
brew "helix"
# Http cli
brew "xh"
# TUI for http API
brew "posting"
# Cli for http calls
brew "curlie"
# Show code language proportion in project
brew "tokei"
# Task runner in Markdown
brew "mask"
# Multiple tasks runner
brew "mprocs"
# SOPS encryption
brew "sops"
# Direnv + local version of packages
brew "mise"
# AI
brew "gemini-cli"


#################
#   Multimedia  #
#################
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Feature-rich command-line audio/video downloader
brew "yewtube"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Cli image viewer
brew "chafa"
# Slides in markdown
brew "presenterm"

##############################
#   Programming development  #
##############################
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# To manange difference JDK
tap "sdkman/tap"
# Manage multiple Node.js versions
brew "nvm"
# JavaScript package manager
brew "yarn"
# LSP java
brew "jdtls"
