########################
#   Terminal emulator  #
########################
# GPU-based terminal emulator
cask "kitty"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Cross-shell prompt for astronauts
brew "starship"

###################
#   System admin  #
###################
# updated full bash -- default may not be the one you want
brew "bash"
# Fish shel;
brew "fish"
# Modern shell for the GitHub era
brew "nushell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Load/unload environment variables based on $PWD
brew "direnv"

######################
#   Developer tools  #
######################
# Distributed revision control system
brew "git"
# GitHub command-line tool
brew "gh"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# App to build and share containerised applications and microservices
cask "docker"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Kubernetes command-line interfac
brew "kubectl"
# Kubernetes package manager
brew "helm"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Terraform
brew "terraform"
# Epic Substrate AOP AWS helper
tap "substrate/tap", "git@github.ol.epicgames.net:substrate/homebrew-tap.git"
brew "substrate/tap/aop"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Collaboration platform for API development
cask "postman"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# CLI for Keeper
brew "keeper-commander"
# JIRA terminal client
brew "jira-cli"

#################
#   Multimedia  #
#################
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"

##############################
#   Programming development  #
##############################
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# To manange difference JDK
tap "sdkman/tap"
# Manage multiple Node.js versions
brew "nvm"
# JavaScript package manager
brew "yarn"

